Revit 2027 API
BuiltInFailures Class
Provides a container of all Revit built-in FailureDefinitionId instances.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.BuiltInFailures
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static class BuiltInFailures
Public NotInheritable Class BuiltInFailures
public ref class BuiltInFailures abstract sealed
[<AbstractClassAttribute>]
[<SealedAttribute>]
type BuiltInFailures = class end
See Also
Reference
Autodesk.Revit.DB Namespace